Bucknalla/efm32-arduino-core/hardware/arm/efm32/cores/arduino/efm32/HardwareSerial.cpp
void HardwareSerial::initSerialGpio(void) {

#if  defined(USART0)&& (USE_USART0 >0)
  if (this->instance == USART0) {
	 
    /* To avoid false start, configure output as high */
    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART0_TX_PORT(this->routeLoc),
                    AF_USART0_TX_PIN(this->routeLoc),
                    gpioModePushPull, 1);

    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART0_RX_PORT(this->routeLoc),
                    AF_USART0_RX_PIN(this->routeLoc),
                    gpioModeInputPull, 0);
	buf->mode = USART_TYPE;
    }
#endif

#if   defined(USART1)&& (USE_USART1 >0)
  if (this->instance == USART1) {
    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART1_TX_PORT(this->routeLoc),
                    AF_USART1_TX_PIN(this->routeLoc),
                    gpioModePushPull, 1);

    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART1_RX_PORT(this->routeLoc),
                    AF_USART1_RX_PIN(this->routeLoc),
                    gpioModeInputPull, 0);
	buf->mode = USART_TYPE;
  }
#endif

#if   defined(USART2)&& (USE_USART2 >0)
  if (this->instance == USART2) {
    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART2_TX_PORT(this->routeLoc),
                    AF_USART2_TX_PIN(this->routeLoc),
                    gpioModePushPull, 1);

    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART2_RX_PORT(this->routeLoc),
                    AF_USART2_RX_PIN(this->routeLoc),
                    gpioModeInputPull, 0);
	buf->mode = USART_TYPE;
  }
#endif

#if   defined(USART3)&& (USE_USART3 >0)
  if (this->instance == USART3) {
    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART3_TX_PORT(this->routeLoc),
                    AF_USART3_TX_PIN(this->routeLoc),
                    gpioModePushPull, 1);

    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART3_RX_PORT(this->routeLoc),
                    AF_USART3_RX_PIN(this->routeLoc),
                    gpioModeInputPull, 0);
	buf->mode = USART_TYPE;
  }
#endif

#if   defined(USART4)&& (USE_USART4 >0)
  if (this->instance == USART4) {
    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART4_TX_PORT(this->routeLoc),
                    AF_USART4_TX_PIN(this->routeLoc),
                    gpioModePushPull, 1);

    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART4_RX_PORT(this->routeLoc),
                    AF_USART4_RX_PIN(this->routeLoc),
                    gpioModeInputPull, 0);
	buf->mode = USART_TYPE;
  }
#endif

#if   defined(USART5)&& (USE_USART5 >0)
  if (this->instance == USART5) {
    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART5_TX_PORT(this->routeLoc),
                    AF_USART5_TX_PIN(this->routeLoc),
                    gpioModePushPull, 1);

    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART5_RX_PORT(this->routeLoc),
                    AF_USART5_RX_PIN(this->routeLoc),
                    gpioModeInputPull, 0);
	buf->mode = USART_TYPE;
  }
#endif
#if   defined(UART0)&& (USE_UART0 >0)
  if (this->instance == UART0) {
    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_UART0_TX_PORT(this->routeLoc),
                    AF_UART0_TX_PIN(this->routeLoc),
                    gpioModePushPull, 1);

    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_UART0_RX_PORT(this->routeLoc),
                    AF_USART5_RX_PIN(this->routeLoc),
                    gpioModeInputPull, 0);
	buf->mode = UART_TYPE;
  }
#endif
#if   defined(UART1)&& (USE_UART1 >0)
  if (this->instance == UART1) {
    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_UART1_TX_PORT(this->routeLoc),
                    AF_UART1_TX_PIN(this->routeLoc),
                    gpioModePushPull, 1);

    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_UART1_RX_PORT(this->routeLoc),
                    AF_UART1_RX_PIN(this->routeLoc),
                    gpioModeInputPull, 0);
	buf->mode = UART_TYPE;
  }
#endif
#if defined(LEUART0)&& (USE_LEUART0 >0)
  if (this->instance == (USART_TypeDef *)LEUART0) {
    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_LEUART0_TX_PORT(this->routeLoc),
                    AF_LEUART0_TX_PIN(this->routeLoc),
                    gpioModePushPull, 1);

    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_LEUART0_RX_PORT(this->routeLoc),
                    AF_LEUART0_RX_PIN(this->routeLoc),
                    gpioModeInputPull, 0);
	buf->mode = LEUART_TYPE;
  }
#endif
#if   defined(LEUART1)&& (USE_LEUART1 >0)
  if (this->instance == (USART_TypeDef *)LEUART1) {
    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_LEUART1_TX_PORT(this->routeLoc),
                    AF_LEUART1_TX_PIN(this->routeLoc),
                    gpioModePushPull, 1);

    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_LEUART1_RX_PORT(this->routeLoc),
                    AF_LEUART1_RX_PIN(this->routeLoc),
                    gpioModeInputPull, 0);
	buf->mode = LEUART_TYPE;
  }
#endif
}

void HardwareSerial::begin(USART_Mode_TypeDef  spiMode){
  if(spiMode & SPI_MODE ){    
     if (buf == NULL) {
       buf = (USART_Buf_TypeDef*)malloc(sizeof(USART_Buf_TypeDef));
       buf->instance = this->instance;
	   buf->mode = spiMode;
     }
     initSpiGpio(SPI_MODE);
     initPort();
  } else {
	 begin(SERIAL_BAUDRATE,SERIAL_8N1); /**/
  }
}

void HardwareSerial::begin(const uint32_t baud,uint8_t config ){
  this->baud = baud;
  this->config = config;
  if (buf == NULL) {
    buf = (USART_Buf_TypeDef*)malloc(sizeof(USART_Buf_TypeDef));
    buf->instance = this->instance;
  }
  initSerialGpio();  
  initPort();

  if (buf->mode == USART_TYPE) {
    USART_InitAsync_TypeDef initasync = USART_INITASYNC_DEFAULT;
    initasync.baudrate = baud;
    initasync.databits = usartDatabits8;

    if (config < 0x0f) {
      initasync.parity = usartNoParity;   /* No parity. */
    } else if (config < 0x2f) {
      initasync.parity = usartEvenParity; /* Even parity. */
    } else if (config < 0x3f) {
      initasync.parity =  usartOddParity; /* Odd parity. */
    }

    if ((config & 0x0f) == 0x0E) {
      initasync.stopbits = usartStopbits2; /* 1 stopbits. */
    } else {
      initasync.stopbits = usartStopbits1; /* 2 stopbits. */
    }

    initasync.oversampling = usartOVS16;
#if defined( USART_INPUT_RXPRS ) && defined( USART_CTRL_MVDIS )
    initasync.mvdis = 0;
    initasync.prsRxEnable = 0;
    initasync.prsRxCh = usartPrsRxCh0;
#endif
    USART_InitAsync(this->instance, &initasync);
    this->instance->IFC = _USART_IFC_MASK;
	this->instance->IEN = USART_IEN_RXDATAV;
    this->instance->ROUTEPEN |=  USART_ROUTEPEN_TXPEN | USART_ROUTEPEN_RXPEN | USART_ROUTE_LOCATION_LOCx;
  }
  
  if (buf->mode == UART_TYPE) {
	  /*add me*/
  }
}

void HardwareSerial::initPort(void) {
  
#if  defined(USART0)&& (USE_USART0 >0)
  if (this->instance == USART0) {
    USART0_buf = buf;
    USART_Reset(USART0);
    CMU_ClockEnable(cmuClock_USART0, true);
  }
#endif

#if   defined(USART1)&& (USE_USART1 >0)
  if (this->instance == USART1) {
    USART1_buf = buf;
    USART_Reset(USART1);
    CMU_ClockEnable(cmuClock_USART1, true);
  }
#endif

#if   defined(USART2)&& (USE_USART2 >0)
  if (this->instance == USART2) {
    USART2_buf = buf;
    USART_Reset(USART2);
    CMU_ClockEnable(cmuClock_USART2, true);
  }
#endif

#if   defined(USART3)&& (USE_USART3 >0)
  if (this->instance == USART3) {
    USART3_buf = buf;
    USART_Reset(USART3);
    CMU_ClockEnable(cmuClock_USART3, true);
  }
#endif

